<a href="https://colab.research.google.com/github/Rupasri0105/23CSBTB30/blob/main/Part_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Part 3 â€“ Access Data from Various Data Sources using builtin Function of Numpy, Pandas[CO3]**

In [3]:
import pandas as pd
data=pd.read_excel("EXCEL WORKBOOK.xlsx")
print(data)

     SID      NAME  AGE  COURSE     CONTACT
0   1918      RUPA   19  B Tech  8688784288
1   1543  HRUTHIKA   19  B Tech  8328015334
2   1886   SPURTHI   18  B Tech  8806399206
3   1560   ANURATH   19  B Tech  8885299732
4   1038    PRANAV   18  B Tech  9676249100
5   1163     VINNY   19  B Tech  7670891946
6   1919   KETHANA   19  B Tech  8074682885
7   1653    ANJALI   18  B Tech  9347673150
8   1123   SATWIKA   19  B Tech  8328018900
9   1342  VAISHALI   18  B Tech  9492440264
10  1206  NISHITHA   19  B Tech  9492910523
11  1678  NANDHINI   19  B Tech  9490377674
12  1802      TEJU   19  B Tech  9365789231
13  1928    JYOTHI   20  B Tech  8345786219
14  1578   NIKITHA   18  B Tech  9060315029
15  1880   SUNISHA   20  B Tech  8094367218
16  1765    SWATHI   19  B Tech  8797853265
17  1534    SWAPNA   20  B Tech  9345908641
18  1890   KAVITHA   19  B Tech  8365478901

In [5]:
import pandas as pd
data=pd.read_csv("/content/EXCEL WORKBOOK.csv")
print(data)

     SID      NAME  AGE  COURSE     CONTACT
0   1918      RUPA   19  B Tech  8688784288
1   1543  HRUTHIKA   19  B Tech  8328015334
2   1886   SPURTHI   18  B Tech  8806399206
3   1560   ANURATH   19  B Tech  8885299732
4   1038    PRANAV   18  B Tech  9676249100
5   1163     VINNY   19  B Tech  7670891946
6   1919   KETHANA   19  B Tech  8074682885
7   1653    ANJALI   18  B Tech  9347673150
8   1123   SATWIKA   19  B Tech  8328018900
9   1342  VAISHALI   18  B Tech  9492440264
10  1206  NISHITHA   19  B Tech  9492910523
11  1678  NANDHINI   19  B Tech  9490377674
12  1802      TEJU   19  B Tech  9365789231
13  1928    JYOTHI   20  B Tech  8345786219
14  1578   NIKITHA   18  B Tech  9060315029
15  1880   SUNISHA   20  B Tech  8094367218
16  1765    SWATHI   19  B Tech  8797853265
17  1534    SWAPNA   20  B Tech  9345908641
18  1890   KAVITHA   19  B Tech  8365478901

In [6]:
import pandas as pd
data=pd.read_table("/content/EXCEL WORKBOOK.txt")
print(data)

     SID      NAME  AGE  COURSE     CONTACT
0   1918      RUPA   19  B Tech  8688784288
1   1543  HRUTHIKA   19  B Tech  8328015334
2   1886   SPURTHI   18  B Tech  8806399206
3   1560   ANURATH   19  B Tech  8885299732
4   1038    PRANAV   18  B Tech  9676249100
5   1163     VINNY   19  B Tech  7670891946
6   1919   KETHANA   19  B Tech  8074682885
7   1653    ANJALI   18  B Tech  9347673150
8   1123   SATWIKA   19  B Tech  8328018900
9   1342  VAISHALI   18  B Tech  9492440264
10  1206  NISHITHA   19  B Tech  9492910523
11  1678  NANDHINI   19  B Tech  9490377674
12  1802      TEJU   19  B Tech  9365789231
13  1928    JYOTHI   20  B Tech  8345786219
14  1578   NIKITHA   18  B Tech  9060315029
15  1880   SUNISHA   20  B Tech  8094367218
16  1765    SWATHI   19  B Tech  8797853265
17  1534    SWAPNA   20  B Tech  9345908641
18  1890   KAVITHA   19  B Tech  8365478901

In [7]:
import pandas as pd
data=pd.read_csv("heart.csv")
print(data)

      age  sex  cp  trestbps  chol  fbs  restecg  thalach  exang  oldpeak  \
0      52    1   0       125   212    0        1      168      0      1.0
1      53    1   0       140   203    1        0      155      1      3.1
2      70    1   0       145   174    0        1      125      1      2.6
3      61    1   0       148   203    0        1      161      0      0.0
4      62    0   0       138   294    1        1      106      0      1.9
...   ...  ...  ..       ...   ...  ...      ...      ...    ...      ...
1020   59    1   1       140   221    0        1      164      1      0.0
1021   60    1   0       125   258    0        0      141      1      2.8
1022   47    1   0       110   275    0        0      118      1      1.0
1023   50    0   0       110   254    0        0      159      0      0.0
1024   54    1   0       120   188    0        1      113      0      1.4

      slope  ca  thal  target
0         2   2     3       0
1         0   0     3       0
2         0   0     3       0
3         2   1     3       0
4         1   3     2       0
...     ...  ..   ...     ...
1020      2   0     2       1
1021      1   1     3       0
1022      1   1     2       0
1023      2   0     2       1
1024      1   1     3       0

[1025 rows x 14 columns]

In [8]:
import pandas as pd
data=pd.read_csv("games_dataset.csv")
print(data)

                                    Game Name       Genre         Platform  \
0                   Sekiro: Shadows Die Twice      Sports  Nintendo Switch
1                                     Control      Puzzle  Nintendo Switch
2                                    Among Us    Strategy  Nintendo Switch
3                Call of Duty: Modern Warfare     Stealth      PlayStation
4                           League of Legends  Simulation               PC
...                                       ...         ...              ...
4995  The Legend of Zelda: Breath of the Wild      Sports               PC
4996                Assassin's Creed Valhalla     Stealth           Mobile
4997             Fall Guys: Ultimate Knockout      Sports           Mobile
4998                            Borderlands 3  Platformer             Xbox
4999         Counter-Strike: Global Offensive      Action      PlayStation

      Release Year  User Rating
0             2014     9.654719
1             2000     3.457386
2             2007     5.367622
3             2005     1.240325
4             2021     3.535476
...            ...          ...
4995          2013     6.352838
4996          2020     1.852730
4997          2021     5.268067
4998          2018     4.558510
4999          2022     3.443231

[5000 rows x 5 columns]